Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийНомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БессрочныйДоговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура БессрочныйДоговорПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


    &НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено (Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;	
КонецПроцедуры



&НаКлиенте   


Процедура УстановитьВидимость()

Если Объект.БессрочныйДоговор Тогда //1

    Элементы.СрокДействияДоговора.Видимость = Ложь;

    Если ЗначениеЗаполнено(Объект.СрокДействияДоговора) Тогда //2

        Объект.СрокДействияДоговора = '0001,01,01';

    КонецЕсли;

Иначе

    Элементы.СрокДействияДоговора.Видимость = Истина;

КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнийНомерДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры


 &НаКлиенте
 Процедура СформироватьНаименованиеДоговора()
	 
	Если ЗначениеЗаполнено(Объект.ВнешнийНомерДоговора)
		 И ЗначениеЗаполнено(Объект.ДатаЗаключения) Тогда
		 Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора + " от " + Объект.ДатаЗаключения;
	ИначеЕсли ЗначениеЗаполнено (Объект.ВнешнийНомерДоговора)
		И НЕ ЗначениеЗаполнено (Объект.ДатаЗаключения) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора;
	Иначе
		Объект.Наименование = " от " + Объект.ДатаЗаключения;
		 
КонецЕсли;
	 
	 
	 
	 
КонецПроцедуры
